Console.WriteLine("START");
// Напишите программу, которая на вход принимает  два числа и выдает,
// какое число большее, какое число меньшее.

int a = -15; //Ввод переменной a;
int b = -38;//Ввод переменной b;
int max = a; // Ввод max = a (при услвии что max = a)

if ( b > max ){
    max = b; // Ввод условия если b>max если да
    }         

System.Console.WriteLine(max); // вывод максимального числа из 2
Console.WriteLine("END");