//Напишите программу, которая принимает на вход три числа и выдаёт максимальное из этих чисел.
// 2, 3, 7 -> 7
// 44 5 78 -> 78
// 22 3 9 -> 22
Console.WriteLine("Start");

int a = 4;
int b = 3;
int c = 22;
int max = 0;

max = a;
if (b > max){
    max = b;
    };
if (c > max){
    max = c;
    }



System.Console.WriteLine(max);
Console.WriteLine("End");