using static MyLibrary;
public class Ex_002_DigitalSum
{
    public static void Task27()
    {
        //Напишите программу, которая принимает на вход число и выдаёт сумму цифр в числе.
        //452 -> 11
        //82 -> 10
        //9012 -> 12
        
        System.Console.WriteLine(DigitSumIn(452));
    }
}